
#Область ОписаниеПеременных

// Контекст обработчика
Перем _Контекст;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Получить метод выполненого HTTP-запроса
// 
// Возвращаемое значение:
//  Строка
//
Функция Метод() Экспорт
	
	Возврат _Контекст.Ответ.Метод;
	
КонецФункции

// Получить URL выполненого HTTP-запроса
// 
// Возвращаемое значение:
//  Строка
//
Функция УРЛ() Экспорт
	
	Возврат _Контекст.Ответ.URL;
	
КонецФункции

// Код состояния "Информация" (100...199)
//
// Возвращаемое значение:
//  Булево
//
Функция КодСостоянияИнформация() Экспорт
	
	Возврат _Контекст.Ответ.КодСостояния >= 100
		И _Контекст.Ответ.КодСостояния < 200;
	
КонецФункции

// Код состояния "Успешно" (200...299)
//
// Возвращаемое значение:
//  Булево
//
Функция КодСостоянияУспешно() Экспорт
	
	Возврат _Контекст.Ответ.КодСостояния >= 200
		И _Контекст.Ответ.КодСостояния < 300;
	
КонецФункции

// Код состояния "Переадресация" (300...399)
//
// Возвращаемое значение:
//  Булево
//
Функция КодСостоянияПереадресация() Экспорт
	
	Возврат _Контекст.Ответ.КодСостояния >= 300
		И _Контекст.Ответ.КодСостояния < 400;
	
КонецФункции

// Код состояния "Ошибка клиента" (400...499)
//
// Возвращаемое значение:
//  Булево
//
Функция КодСостоянияОшибкаКлиента() Экспорт
	
	Возврат _Контекст.Ответ.КодСостояния >= 400
		И _Контекст.Ответ.КодСостояния < 500;
	
КонецФункции

// Код состояния "Ошибка сервера" (500...599)
//
// Возвращаемое значение:
//  Булево
//
Функция КодСостоянияОшибкаСервера() Экспорт
	
	Возврат _Контекст.Ответ.КодСостояния >= 500
		И _Контекст.Ответ.КодСостояния < 600;
	
КонецФункции

// Код состояния равен значению
//
// Параметры:
//  КодСостояния - Число
//
// Возвращаемое значение:
//  Булево
//
Функция КодСостоянияРавен(КодСостояния) Экспорт
	
	Возврат _Контекст.Ответ.КодСостояния = КодСостояния;
	
КонецФункции

// Получить код состояния
//
// Возвращаемое значение:
//  Число
//
Функция КодСостояния() Экспорт
	
	Возврат _Контекст.Ответ.КодСостояния;
	
КонецФункции

// Получить тело ответа как строку
//
// Параметры:
//   Кодировка - Строка, КодировкаТекста
//
// Возвращаемое значение:
//  Строка
//
Функция ТелоОтветаКакСтрока(Кодировка = Неопределено) Экспорт
	
	Возврат КоннекторHTTP.КакТекст(_Контекст.Ответ, Кодировка); // BSLLS:MissingCommonModuleMethod-off
	
КонецФункции

// Получить и обработать тело ответа как JSON 
//
// Параметры:
//  ПараметрыПреобразованияJSON - Структура:
//    * ПрочитатьВСоответствие - Булево
//    * ФорматДатыJSON - ФорматДатыJSON
//    * ИменаСвойствСоЗначениямиДата -  Массив из Строка, Строка
//    * ИмяФункцииВосстановления - Строка
//    * МодульФункцииВосстановления - Произвольный
//    * ДополнительныеПараметрыФункцииВосстановления - Произвольный
//    * ИменаСвойствДляОбработкиВосстановления - Массив
//    * МаксимальнаяВложенность - Число
//
// Возвращаемое значение:
//  Структура, Соответствие, Массив
//
Функция ТелоОтветаКакJson(ПараметрыПреобразованияJSON = Неопределено) Экспорт
	
	Возврат КоннекторHTTP.КакJson(_Контекст.Ответ, ПараметрыПреобразованияJSON); // BSLLS:MissingCommonModuleMethod-off
	
КонецФункции

// Получить и обработать тело ответа как XDTO.
//
// Параметры:
//  ПараметрыЧтенияXML - ПараметрыЧтенияXML
//  НаборСхемXML - НаборСхемXML
//  Кодировка - Строка, КодировкаТекста
//
// Возвращаемое значение:
//  ОбъектXDTO, СписокXDTO
//
Функция ТелоОтветаКакXDTO(ПараметрыЧтенияXML = Неопределено, НаборСхемXML = Неопределено, Кодировка = Неопределено) Экспорт
	
	Возврат КоннекторHTTP.КакXDTO( // BSLLS:MissingCommonModuleMethod-off
		_Контекст.Ответ, ПараметрыЧтенияXML, НаборСхемXML, Кодировка);
	
КонецФункции

// Получить тело ответа как двоичные данные
//
// Возвращаемое значение:
//  ДвоичныеДанные
//
Функция ТелоОтветаКакДвоичныеДанные() Экспорт
	
	Возврат КоннекторHTTP.КакДвоичныеДанные(_Контекст.Ответ); // BSLLS:MissingCommonModuleMethod-off
	
КонецФункции

// Получить тело ответа как строку, предназначенного для использования в ВызватьИсключение.
//
// Параметры:
//  ТекстДляПользователя - Строка
//
// Возвращаемое значение:
//  Строка
//
Функция ТелоОтветаКакИсключение(ТекстДляПользователя = Неопределено) Экспорт
	
	Возврат КоннекторHTTP.КакИсключение(_Контекст.Ответ, ТекстДляПользователя); // BSLLS:MissingCommonModuleMethod-off
	
КонецФункции

// Есть ошибки выполнения HTTP-запроса
// 
// Возвращаемое значение:
//  Булево
//
Функция ЕстьОшибки() Экспорт
	
	Возврат _Контекст.Ответ.Ошибки.Количество() > 0;
	
КонецФункции

// Получить ошибки выполнения HTTP-запроса
// 
// Возвращаемое значение:
//  Массив из Строка
//
Функция Ошибки() Экспорт
	
	Возврат _Контекст.Ответ.Ошибки;
	
КонецФункции

// Получить время выполнения HTTP-запроса
// 
// Возвращаемое значение:
//  Число
//
Функция ВремяВыполнения() Экспорт
	
	Возврат _Контекст.Ответ.ВремяВыполнения;
	
КонецФункции

// Это редирект HTTP-запроса
// 
// Возвращаемое значение:
//  Булево
//
Функция ЭтоРедирект() Экспорт
	
	Возврат _Контекст.Ответ.ЭтоРедирект;
	
КонецФункции

// Это постоянный редирект HTTP-запроса
// 
// Возвращаемое значение:
//  Булево
//
Функция ЭтоПостоянныйРедирект() Экспорт
	
	Возврат _Контекст.Ответ.ЭтоПостоянныйРедирект;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Инициализировать обработчик HTTP-ответа
//
// Параметры:
//  Ответ - Структура - см. КоннекторHTTP.НовыйОтвет()
//
// Возвращаемое значение:
//  ОбработкаОбъект.ОбработчикHTTPОтвета
//
Функция Инициализировать(Ответ) Экспорт
	
	_Контекст = НовыйКонтекст();
	ЗаполнитьЗначенияСвойств(_Контекст.Ответ, Ответ);
	
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор нового контекст
//
// Возвращаемое значение:
//  Структура:
//    * Ответ - Структура - см. КоннекторHTTP.НовыйОтвет()
//
Функция НовыйКонтекст()
	
	Контекст = Новый Структура;
	Контекст.Вставить("Ответ", КоннекторHTTP.НовыйОтвет()); // BSLLS:MissingCommonModuleMethod-off
	
	Возврат Контекст;
	
КонецФункции

#КонецОбласти
