
#Область ПрограммныйИнтерфейс

// Создать новый HTTP-запрос
//
// Параметры:
//  Сессия - Структура - см. КоннекторHTTP.СоздатьСессию
//  Параметры - Структура - см. ПараметрыЗапроса
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPЗапроса
//
Функция Запрос(Сессия = Неопределено, Параметры = Неопределено) Экспорт
	
	Возврат КонструкторHTTPЗапроса().Инициализировать(Сессия, Параметры);
	
КонецФункции

// Создать новую HTTP-сессию
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция Сессия() Экспорт
	
	Возврат КонструкторHTTPСессии();
	
КонецФункции

#Область Конструкторы

// Конструктор новых параметров запроса
//
// Возвращаемое значение:
//  Структура:
//    * Метод - Строка
//    * Сервер - Строка
//    * Порт - Число
//    * АдресРесурса - Строка
//    * Таймаут - Число
//    * ЗащищенноеСоединение - Булево
//
Функция ПараметрыЗапроса() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Метод", "");
	Параметры.Вставить("Сервер", "");
	Параметры.Вставить("Порт", 0);
	Параметры.Вставить("АдресРесурса", "");
	Параметры.Вставить("Таймаут", 0);
	Параметры.Вставить("ЗащищенноеСоединение", Истина);
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область Методы

// Метод GET
//
// Возвращаемое значение:
//  Строка
//
Функция МетодGET() Экспорт
	
	Возврат "GET";
	
КонецФункции

// Метод OPTIONS
//
// Возвращаемое значение:
//  Строка
//
Функция МетодOPTIONS() Экспорт
	
	Возврат "OPTIONS";
	
КонецФункции

// Метод HEAD
//
// Возвращаемое значение:
//  Строка
//
Функция МетодHEAD() Экспорт
	
	Возврат "HEAD";
	
КонецФункции

// Метод POST
//
// Возвращаемое значение:
//  Строка
//
Функция МетодPOST() Экспорт
	
	Возврат "POST";
	
КонецФункции

// Метод PUT
//
// Возвращаемое значение:
//  Строка
//
Функция МетодPUT() Экспорт
	
	Возврат "PUT";
	
КонецФункции

// Метод PATCH
//
// Возвращаемое значение:
//  Строка
//
Функция МетодPATCH() Экспорт
	
	Возврат "PATCH";
	
КонецФункции

// Метод DELETE
//
// Возвращаемое значение:
//  Строка
//
Функция МетодDELETE() Экспорт
	
	Возврат "DELETE";
	
КонецФункции

// Метод CONNECT
//
// Возвращаемое значение:
//  Строка
//
Функция МетодCONNECT() Экспорт
	
	Возврат "CONNECT";
	
КонецФункции

// Метод TRACE
//
// Возвращаемое значение:
//  Строка
//
Функция МетодTRACE() Экспорт
	
	Возврат "TRACE";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Конструктор нового конструктора HTTP-запроса
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPЗапроса
//
Функция КонструкторHTTPЗапроса() Экспорт
	
	УстановитьПривилегированныйРежим(Истина); // BSLLS:SetPrivilegedMode-off
	
	Возврат Обработки.КонструкторHTTPЗапроса.Создать();
	
КонецФункции

// Конструктор нового конструктора HTTP-сессии
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция КонструкторHTTPСессии() Экспорт
	
	УстановитьПривилегированныйРежим(Истина); // BSLLS:SetPrivilegedMode-off
	
	Возврат Обработки.КонструкторHTTPСессии.Создать();
	
КонецФункции

// Конструктор нового обработчка HTTP-ответа
//
// Возвращаемое значение:
//  ОбработкаОбъект.ОбработчикHTTPОтвета
//
Функция ОбработчикHTTPОтвета() Экспорт
	
	УстановитьПривилегированныйРежим(Истина); // BSLLS:SetPrivilegedMode-off
	
	Возврат Обработки.ОбработчикHTTPОтвета.Создать();
	
КонецФункции

#КонецОбласти
