
#Область ПрограммныйИнтерфейс

// Конструктор нового HTTP-запроса
//
// Параметры:
//  Сессия - Структура - см. КоннекторHTTP.СоздатьСессию()
//         - Неопределено
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPЗапроса
//
Функция Запрос(Сессия = Неопределено) Экспорт
	
	Возврат КонструкторHTTPПолныеПрава.КонструкторHTTPЗапроса()
		.Инициализировать(Сессия);
	
КонецФункции

// Конструктор новой HTTP-сессии
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция Сессия() Экспорт
	
	Возврат КонструкторHTTPПолныеПрава.КонструкторHTTPСессии()
		.Инициализировать();
	
КонецФункции

#КонецОбласти
