
#Область ПрограммныйИнтерфейс

// Создать новый HTTP-запрос
//
// Параметры:
//  Сессия - Структура - см. КоннекторHTTP.СоздатьСессию
//  Параметры - Структура - см. ПараметрыЗапроса
//  Аутентификация - Структура - см. ПараметрыАутентификации
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPЗапроса
//
Функция Запрос(Сессия = Неопределено, Параметры = Неопределено, Аутентификация = Неопределено) Экспорт
	
	Возврат КонструкторHTTPСлужебный.КонструкторHTTPЗапроса()
		.Инициализировать(Сессия, Параметры, Аутентификация);
	
КонецФункции

// Создать новую HTTP-сессию
//
// Параметры:
//  Аутентификация - Структура - см. ПараметрыАутентификации
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция Сессия(Аутентификация = Неопределено) Экспорт
	
	Возврат КонструкторHTTPСлужебный.КонструкторHTTPСессии()
		.Инициализировать(Аутентификация);
	
КонецФункции

#Область Конструкторы

// Конструктор новых параметров аутентификации
//
// Возвращаемое значение:
//  Структура:
//    * ИдентификаторКлючаДоступа - Строка - Используется для типа аутентификации AWS4
//    * Пароль - Строка - Используется для типа аутентификации Basic или Digest
//    * Пользователь - Строка - Используется для типа аутентификации Basic или Digest
//    * Регион - Строка - Используется для типа аутентификации AWS4
//    * СекретныйКлюч - Строка - Используется для типа аутентификации AWS4
//    * Сервис - Строка - Используется для типа аутентификации AWS4
//    * Тип - Строка - Тип аутентификации (ОС, Basic, Digest, BearerToken, AWS4)
//    * Токен - Строка - Используется для типа аутентификации BearerToken
//
Функция ПараметрыАутентификации() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИдентификаторКлючаДоступа", "");
	Параметры.Вставить("Пароль", "");
	Параметры.Вставить("Пользователь", "");
	Параметры.Вставить("Регион", "");
	Параметры.Вставить("СекретныйКлюч", "");
	Параметры.Вставить("Сервис", "");
	Параметры.Вставить("Тип", "");
	Параметры.Вставить("Токен", "");
	Возврат Параметры;
	
КонецФункции

// Конструктор новых параметров запроса
//
// Возвращаемое значение:
//  Структура:
//    * АдресРесурса - Строка
//    * ЗащищенноеСоединение - Булево
//    * Метод - Строка
//    * Порт - Число
//    * Сервер - Строка
//    * Таймаут - Число
//
Функция ПараметрыЗапроса() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("АдресРесурса", "");
	Параметры.Вставить("ЗащищенноеСоединение", Истина);
	Параметры.Вставить("Метод", "");
	Параметры.Вставить("Порт", 0);
	Параметры.Вставить("Сервер", "");
	Параметры.Вставить("Таймаут", 0);
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область Методы

// Метод CONNECT
//
// Возвращаемое значение:
//  Строка
//
Функция МетодCONNECT() Экспорт
	
	Возврат "CONNECT";
	
КонецФункции

// Метод DELETE
//
// Возвращаемое значение:
//  Строка
//
Функция МетодDELETE() Экспорт
	
	Возврат "DELETE";
	
КонецФункции

// Метод GET
//
// Возвращаемое значение:
//  Строка
//
Функция МетодGET() Экспорт
	
	Возврат "GET";
	
КонецФункции

// Метод HEAD
//
// Возвращаемое значение:
//  Строка
//
Функция МетодHEAD() Экспорт
	
	Возврат "HEAD";
	
КонецФункции

// Метод OPTIONS
//
// Возвращаемое значение:
//  Строка
//
Функция МетодOPTIONS() Экспорт
	
	Возврат "OPTIONS";
	
КонецФункции

// Метод PATCH
//
// Возвращаемое значение:
//  Строка
//
Функция МетодPATCH() Экспорт
	
	Возврат "PATCH";
	
КонецФункции

// Метод POST
//
// Возвращаемое значение:
//  Строка
//
Функция МетодPOST() Экспорт
	
	Возврат "POST";
	
КонецФункции

// Метод PUT
//
// Возвращаемое значение:
//  Строка
//
Функция МетодPUT() Экспорт
	
	Возврат "PUT";
	
КонецФункции

// Метод TRACE
//
// Возвращаемое значение:
//  Строка
//
Функция МетодTRACE() Экспорт
	
	Возврат "TRACE";
	
КонецФункции

#КонецОбласти

#Область ТипыАутентификации

// Тип аутентификации AWS4
//
// Возвращаемое значение:
//  Строка
//
Функция ТипАутентификацииAWS4() Экспорт
	
	Возврат "AWS4";
	
КонецФункции

// Тип аутентификации Basic
//
// Возвращаемое значение:
//  Строка
//
Функция ТипАутентификацииBasic() Экспорт
	
	Возврат "Basic";
	
КонецФункции

// Тип аутентификации BearerToken
//
// Возвращаемое значение:
//  Строка
//
Функция ТипАутентификацииBearerToken() Экспорт
	
	Возврат "BearerToken";
	
КонецФункции

// Тип аутентификации Digest
//
// Возвращаемое значение:
//  Строка
//
Функция ТипАутентификацииDigest() Экспорт
	
	Возврат "Digest";
	
КонецФункции

// Тип аутентификации ОС
//
// Возвращаемое значение:
//  Строка
//
Функция ТипАутентификацииОС() Экспорт
	
	Возврат "ОС";
	
КонецФункции

#КонецОбласти

#КонецОбласти
