
#Область ПрограммныйИнтерфейс

// Создать новый HTTP-запрос
//
// Параметры:
//  Сессия - Структура - см. КоннекторHTTP.СоздатьСессию
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPЗапроса
//
Функция Запрос(Сессия = Неопределено) Экспорт
	
	Возврат НовыйКонструкторHTTPЗапроса().Инициализировать(Сессия);
	
КонецФункции

// Создать новую HTTP-сессию
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция Сессия() Экспорт
	
	Возврат НовыйКонструкторHTTPСессии().Инициализировать();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор нового конструктора HTTP-запроса
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPЗапроса
//
Функция НовыйКонструкторHTTPЗапроса()
	
	УстановитьПривилегированныйРежим(Истина); // BSLLS:SetPrivilegedMode-off
	
	Возврат Обработки.КонструкторHTTPЗапроса.Создать();
	
КонецФункции

// Конструктор нового конструктора HTTP-сессии
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция НовыйКонструкторHTTPСессии()
	
	УстановитьПривилегированныйРежим(Истина); // BSLLS:SetPrivilegedMode-off
	
	Возврат Обработки.КонструкторHTTPСессии.Создать();
	
КонецФункции

#КонецОбласти
