
#Область ОписаниеПеременных

// Контекст конструктора
Перем Контекст;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Установить аутентификацию для выполнения HTTP-запроса
//
// Параметры:
//  Аутентификация - Структура - см. КонструкторHTTP.ПараметрыАутентификации
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция Аутентификация(Аутентификация) Экспорт
	
	Если КонструкторHTTPСлужебный.ЭтоАутентификацияAWS4(Аутентификация) Тогда
		АутентификацияAWS4(
			Аутентификация.ИдентификаторКлючаДоступа, Аутентификация.СекретныйКлюч,
			Аутентификация.Сервис, Аутентификация.Регион);
	ИначеЕсли КонструкторHTTPСлужебный.ЭтоАутентификацияBasic(Аутентификация) Тогда
		АутентификацияBasic(Аутентификация.Пользователь, Аутентификация.Пароль);
	ИначеЕсли КонструкторHTTPСлужебный.ЭтоАутентификацияBearerToken(Аутентификация) Тогда
		АутентификацияBearerToken(Аутентификация.Токен);
	ИначеЕсли КонструкторHTTPСлужебный.ЭтоАутентификацияDigest(Аутентификация) Тогда
		АутентификацияDigest(Аутентификация.Пользователь, Аутентификация.Пароль);
	ИначеЕсли КонструкторHTTPСлужебный.ЭтоАутентификацияОС(Аутентификация) Тогда
		АутентификацияОС();
	КонецЕсли; // BSLLS:IfElseIfEndsWithElse-off
	
	Возврат ЭтотОбъект;
	
КонецФункции

// Использовать AWS4-аутентификацию для выполнения HTTP-запроса
//
// Параметры:
//  ИдентификаторКлючаДоступа - Строка
//  СекретныйКлюч - Строка
//  Сервис - Строка
//  Регион - Строка
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция АутентификацияAWS4(ИдентификаторКлючаДоступа = "", СекретныйКлюч = "", Сервис = "", Регион = "") Экспорт
	
	Аутентификация = КоннекторHTTP.НоваяАутентификацияAWS4(
		ИдентификаторКлючаДоступа, СекретныйКлюч, Сервис, Регион); // BSLLS:MissingCommonModuleMethod-off
	Контекст.Сессия.Аутентификация = Аутентификация;
	Возврат ЭтотОбъект;
	
КонецФункции

// Использовать Basic-аутентификацию для выполнения HTTP-запроса
//
// Параметры:
//  Пользователь - Строка
//  Пароль - Строка
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция АутентификацияBasic(Пользователь = "", Пароль = "") Экспорт
	
	Аутентификация = КоннекторHTTP.НоваяАутентификацияBasic(Пользователь, Пароль); // BSLLS:MissingCommonModuleMethod-off
	Контекст.Сессия.Аутентификация = Аутентификация;
	Возврат ЭтотОбъект;
	
КонецФункции

// Использовать BearerToken-аутентификацию для выполнения HTTP-запроса
//
// Параметры:
//  Токен - Строка
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция АутентификацияBearerToken(Токен = "") Экспорт
	
	Ключ = "Authorization";
	Значение = СтрШаблон("Bearer %1", Токен);
	ДобавитьЗаголовок(Ключ, Значение);
	Возврат ЭтотОбъект;
	
КонецФункции

// Использовать Digest-аутентификацию для выполнения HTTP-запроса
//
// Параметры:
//  Пользователь - Строка
//  Пароль - Строка
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция АутентификацияDigest(Пользователь = "", Пароль = "") Экспорт
	
	Аутентификация = КоннекторHTTP.НоваяАутентификацияDigest(Пользователь, Пароль); // BSLLS:MissingCommonModuleMethod-off
	Контекст.Сессия.Аутентификация = Аутентификация;
	Возврат ЭтотОбъект;
	
КонецФункции

// Использовать аутентификацию ОС для выполнения HTTP-запроса
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция АутентификацияОС() Экспорт
	
	Аутентификация = КоннекторHTTP.НоваяАутентификацияОС(); // BSLLS:MissingCommonModuleMethod-off
	Контекст.Сессия.Аутентификация = Аутентификация;
	Возврат ЭтотОбъект;
	
КонецФункции

// Добавить заголовок HTTP-запроса
//
// Параметры:
//  Ключ - Строка
//  Значение - Строка
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция ДобавитьЗаголовок(Ключ, Значение = "") Экспорт
	
	Контекст.Сессия.Заголовки.Вставить(Ключ, Значение);
	Возврат ЭтотОбъект;
	
КонецФункции

// Добавить заголовки HTTP-запроса
//
// Параметры:
//  Заголовки - Структура, Соответствие
//    * Ключ - Строка
//    * Значение - Строка
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция ДобавитьЗаголовки(Заголовки) Экспорт
	
	Для Каждого Заголовок Из Заголовки Цикл
		ДобавитьЗаголовок(Заголовок.Ключ, Заголовок.Значение);
	КонецЦикла;
	
	Возврат ЭтотОбъект;
	
КонецФункции

// Добавить Cookie HTTP-запроса
//
// Параметры:
//  Ключ - Строка
//  Значение - Строка
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция ДобавитьКуку(Ключ, Значение = "") Экспорт
	
	Контекст.Сессия.Cookies.Вставить(Ключ, Значение);
	Возврат ЭтотОбъект;
	
КонецФункции

// Добавить Cookies HTTP-запроса
//
// Параметры:
//  Куки - Структура, Соответствие
//    * Ключ - Строка
//    * Значение - Строка
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция ДобавитьКуки(Куки) Экспорт
	
	Для Каждого Кука Из Куки Цикл
		ДобавитьКуку(Кука.Ключ, Кука.Значение);
	КонецЦикла;
	
	Возврат ЭтотОбъект;
	
КонецФункции

// Добавить параметр HTTP-запроса
//
// Параметры:
//  Ключ - Строка
//  Значение - Строка
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция ДобавитьПараметрЗапроса(Ключ, Значение = "") Экспорт
	
	Контекст.Сессия.ПараметрыЗапроса.Вставить(Ключ, Значение);
	Возврат ЭтотОбъект;
	
КонецФункции

// Добавить параметры HTTP-запроса
//
// Параметры:
//  ПараметрыЗапроса - Структура, Соответствия
//    * Ключ - Строка
//    * Значение - Строка
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция ДобавитьПараметрыЗапроса(ПараметрыЗапроса) Экспорт
	
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		ДобавитьПараметрЗапроса(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;
	
	Возврат ЭтотОбъект;
	
КонецФункции

// Использовать клиентский сертификатор SSL
//
// Параметры:
//  СертификатКлиента - СертификатКлиентаФайл, СертификатКлиентаWindows
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция КлиентскийСертификатSSL(СертификатКлиента) Экспорт
	
	Контекст.Сессия.КлиентскийСертификатSSL = СертификатКлиента;
	Возврат ЭтотОбъект;
	
КонецФункции

// Установить максимальное количество перенаправлений HTTP-запроса
//
// Параметры:
//  Значение - Число
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция МаксимальноеКоличествоПеренаправлений(Значение) Экспорт
	
	Контекст.Сессия.МаксимальноеКоличествоПеренаправлений = Значение;
	Возврат ЭтотОбъект;
	
КонецФункции

// Проверять сертификат сервера
//
// Параметры:
//  Значение - Булево, СертификатыУдостоверяющихЦентровФайл
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция ПроверятьSSL(Значение = Истина) Экспорт
	
	Контекст.Сессия.ПроверятьSSL = Значение;
	Возврат ЭтотОбъект;
	
КонецФункции

// Использовать прокси для выполнения HTTP-запроса
//
// Параметры:
//  ИнтернетПрокси - ИнтернетПрокси
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция Прокси(ИнтернетПрокси) Экспорт
	
	Контекст.Сессия.Прокси = ИнтернетПрокси;
	Возврат ЭтотОбъект;
	
КонецФункции

// Создать новую HTTP-сессию 
//
// Возвращаемое значение:
//  Структура - см. КоннекторHTTP.СоздатьСессию
//
Функция Создать() Экспорт
	
	Возврат Контекст.Сессия;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Инициализировать конструктор HTTP-сессии
//
// Параметры:
//  Аутентификация - Структура - см. КонструкторHTTP.ПараметрыАутентификации
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPЗапроса
//
Функция Инициализировать(Аутентификация = Неопределено) Экспорт
	
	Если КонструкторHTTPСлужебный.ЭтоСтруктура(Аутентификация) Тогда
		Аутентификация(Аутентификация);
	КонецЕсли;
	
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор нового контекст
//
// Возвращаемое значение:
//  Структура:
//    * Сессия - Структура -  см. КоннекторHTTP.СоздатьСессию
//
Функция НовыйКонтекст()
	
	НовыйКонтекст = Новый Структура;
	НовыйКонтекст.Вставить("Сессия", КоннекторHTTP.СоздатьСессию()); // BSLLS:MissingCommonModuleMethod-off
	Возврат НовыйКонтекст;
	
КонецФункции

#КонецОбласти

#Область Инициализация

Контекст = НовыйКонтекст();

#КонецОбласти
