
#Область СлужебныеПроцедурыИФункции

// Конструктор HTTP-запроса
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPЗапроса
//
Функция КонструкторHTTPЗапроса() Экспорт
	
	Возврат Обработки.КонструкторHTTPЗапроса.Создать();
	
КонецФункции

// Конструктор HTTP-сессии
//
// Возвращаемое значение:
//  ОбработкаОбъект.КонструкторHTTPСессии
//
Функция КонструкторHTTPСессии() Экспорт
	
	Возврат Обработки.КонструкторHTTPСессии.Создать();
	
КонецФункции

// Обработчик HTTP-ответа
//
// Возвращаемое значение:
//  ОбработкаОбъект.ОбработчикHTTPОтвета
//
Функция ОбработчикHTTPОтвета() Экспорт
	
	Возврат Обработки.ОбработчикHTTPОтвета.Создать();
	
КонецФункции

#КонецОбласти
